Bwooce/tinygs_nRF52/src/main.cpp
        uint32_t payload_len = MIN(pub->message.payload.len, sizeof(rx_payload) - 1);
        int ret = mqtt_read_publish_payload(client, rx_payload, payload_len);
        if (ret < 0) {
            LOG_ERR("MQTT payload read error: %d", ret);
            break;
        }
        rx_payload[ret] = '\0';

        LOG_INF("MQTT RX [%s] (%d bytes)", rx_topic, ret);
        if (ret < 200) {
            LOG_INF("  payload: %s", (char *)rx_payload);
        }

        /* Extract command name from topic:
         * tinygs/global/cmnd/XXX or tinygs/user/station/cmnd/XXX */
        const char *cmnd = strstr(rx_topic, "/cmnd/");
        if (cmnd) {
            cmnd += 6;  /* skip "/cmnd/" */
            LOG_INF("  command: %s", cmnd);

            if (strcmp(cmnd, "begine") == 0 ||
                strcmp(cmnd, "batch_conf") == 0) {
                /* Reconfigure radio from JSON payload.
                 * Minimal parser — extract freq, sf, bw, cr, sat */
                LOG_INF("  → Applying radio config...");
                if (radio != nullptr) {
                    const char *p;
                    /* Parse and apply frequency */
                    p = strstr((char *)rx_payload, "\"freq\":");
                    if (p) {
                        float freq = strtof(p + 7, NULL);
                        if (freq > 100.0f && freq < 1000.0f) {
                            int st = radio->setFrequency(freq);
                            tinygs_radio.frequency = freq;
                            LOG_INF("  freq=%.4f MHz (%s)", (double)freq,
                                    st == RADIOLIB_ERR_NONE ? "OK" : "FAIL");
                        }
                    }
                    /* Parse and apply SF */
                    p = strstr((char *)rx_payload, "\"sf\":");
                    if (p) {
                        int sf = atoi(p + 5);
                        if (sf >= 5 && sf <= 12) {
                            radio->setSpreadingFactor(sf);
                            tinygs_radio.sf = sf;
                            LOG_INF("  sf=%d", sf);
                        }
                    }
                    /* Parse and apply BW */
                    p = strstr((char *)rx_payload, "\"bw\":");
                    if (p) {
                        float bw = strtof(p + 5, NULL);
                        radio->setBandwidth(bw);
                        tinygs_radio.bw = bw;
                        LOG_INF("  bw=%.1f kHz", (double)bw);
                    }
                    /* Parse and apply CR */
                    p = strstr((char *)rx_payload, "\"cr\":");
                    if (p) {
                        int cr = atoi(p + 5);
                        radio->setCodingRate(cr);
                        tinygs_radio.cr = cr;
                        LOG_INF("  cr=%d", cr);
                    }
                    /* Parse and apply sync word */
                    p = strstr((char *)rx_payload, "\"sw\":");
                    if (p) {
                        int sw = atoi(p + 5);
                        radio->setSyncWord(sw);
                        LOG_INF("  sw=%d", sw);
                    }
                    /* Parse and apply preamble length */
                    p = strstr((char *)rx_payload, "\"pl\":");
                    if (p) {
                        int pl = atoi(p + 5);
                        radio->setPreambleLength(pl);
                        LOG_INF("  pl=%d", pl);
                    }
                    /* Parse and apply inverted IQ */
                    p = strstr((char *)rx_payload, "\"iIQ\":");
                    if (p) {
                        bool iiq = (strncmp(p + 6, "true", 4) == 0);
                        if (iiq) {
                            radio->invertIQ(true);
                        } else {
                            radio->invertIQ(false);
                        }
                        LOG_INF("  iIQ=%s", iiq ? "true" : "false");
                    }
                    /* Parse and apply CRC */
                    p = strstr((char *)rx_payload, "\"crc\":");
                    if (p) {
                        bool crc = (strncmp(p + 6, "true", 4) == 0);
                        radio->setCRC(crc ? 2 : 0);
                        LOG_INF("  crc=%s", crc ? "on" : "off");
                    }
                    /* Parse satellite name */
                    p = strstr((char *)rx_payload, "\"sat\":\"");
                    if (p) {
                        const char *end = strchr(p + 7, '"');
                        if (end && (end - p - 7) < (int)sizeof(tinygs_radio.satellite)) {
                            memcpy(tinygs_radio.satellite, p + 7, end - p - 7);
                            tinygs_radio.satellite[end - p - 7] = '\0';
                            LOG_INF("  satellite: %s", tinygs_radio.satellite);
                        }
                    }
                    /* Parse NORAD */
                    p = strstr((char *)rx_payload, "\"NORAD\":");
                    if (p) {
                        tinygs_radio.norad = (uint32_t)atoi(p + 8);
                        LOG_INF("  NORAD: %u", (unsigned)tinygs_radio.norad);
                    }
                    /* Store raw payload as modem_conf for welcome echo */
                    size_t conf_len = strlen((char *)rx_payload);
                    if (conf_len < sizeof(tinygs_radio.modem_conf)) {
                        memcpy(tinygs_radio.modem_conf, rx_payload, conf_len + 1);
                    }
                    /* Save to NVS only when satellite changes (avoid flash wear) */
                    static char last_saved_sat[32] = "";
                    if (strcmp(tinygs_radio.satellite, last_saved_sat) != 0) {
                        tinygs_config_save_radio();
                        tinygs_config_save_modem_conf(tinygs_radio.modem_conf);
                        strncpy(last_saved_sat, tinygs_radio.satellite,
                                sizeof(last_saved_sat) - 1);
                        LOG_INF("  Config saved to NVS (new satellite)");
                    }
                    /* Restart reception */
                    radio->startReceive();
                    LOG_INF("  Radio reconfigured, listening");
                }
            } else if (strcmp(cmnd, "freq") == 0) {
                /* Direct frequency set (MHz as number) */
                float freq = strtof((char *)rx_payload, NULL);
                if (radio && freq > 100.0f && freq < 1000.0f) {
                    radio->setFrequency(freq);
                    tinygs_radio.frequency = freq;
                    radio->startReceive();
                    LOG_INF("  → freq=%.4f MHz", (double)freq);
                }
            } else if (strcmp(cmnd, "sat") == 0) {
                /* Select satellite — payload is JSON string with sat name */
                const char *p = strstr((char *)rx_payload, "\"");
                if (p) {
                    const char *end = strchr(p + 1, '"');
                    if (end && (end - p - 1) < (int)sizeof(tinygs_radio.satellite)) {
                        memcpy(tinygs_radio.satellite, p + 1, end - p - 1);
                        tinygs_radio.satellite[end - p - 1] = '\0';
                        LOG_INF("  → satellite: %s", tinygs_radio.satellite);
                    }
                }
            } else if (strcmp(cmnd, "set_pos_prm") == 0) {
                tinygs_handle_set_pos((char *)rx_payload, ret);
            } else if (strcmp(cmnd, "set_name") == 0) {
                /* Rename station: ["MAC", "new_name"]
                 * Only apply if MAC matches our device. Needs NVS to persist. */
                extern char device_client_id[13];
                const char *p = strstr((char *)rx_payload, "\"");
                if (p) {
                    const char *end = strchr(p + 1, '"');
                    if (end && (end - p - 1) == 12) {
                        char mac[13];
                        memcpy(mac, p + 1, 12);
                        mac[12] = '\0';
                        if (strcmp(mac, device_client_id) == 0) {
                            /* Find second string (new name) */
                            p = strchr(end + 1, '"');
                            if (p) {
                                end = strchr(p + 1, '"');
                                if (end) {
                                    char name[32];
                                    size_t nlen = end - p - 1;
                                    if (nlen < sizeof(name)) {
                                        memcpy(name, p + 1, nlen);
                                        name[nlen] = '\0';
                                        LOG_INF("  → Rename requested: %s (needs NVS persist)", name);
                                        /* TODO: persist to NVS, reconnect with new name */
                                    }
                                }
                            }
                        } else {
                            LOG_DBG("  → set_name: MAC mismatch (%s != %s)", mac, device_client_id);
                        }
                    }
                }
            } else if (strcmp(cmnd, "status") == 0) {
                tinygs_send_status(client, cfg_mqtt_user, cfg_station);
            } else if (strcmp(cmnd, "reset") == 0) {
                LOG_WRN("  → Reset requested by server");
                k_msleep(500);
                sys_reboot(SYS_REBOOT_COLD);
            } else if (strcmp(cmnd, "tx") == 0) {
                LOG_INF("  → TX not supported (tx=false)");
            } else if (strcmp(cmnd, "log") == 0) {
                LOG_INF("  → Server: %s", (char *)rx_payload);
            } else if (strcmp(cmnd, "sleep") == 0 || strcmp(cmnd, "siesta") == 0) {
                LOG_INF("  → Sleep requested (not implemented yet)");
            } else if (strcmp(cmnd, "foff") == 0) {
                /* Frequency offset in Hz */
                LOG_INF("  → Freq offset: %s Hz (TODO: apply)", (char *)rx_payload);
            } else if (strcmp(cmnd, "filter") == 0) {
                LOG_INF("  → Packet filter: %s (TODO: apply)", (char *)rx_payload);
            } else if (strcmp(cmnd, "update") == 0) {
                LOG_INF("  → OTA update not supported (UF2 bootloader)");
            } else if (strcmp(cmnd, "weblogin") == 0) {
                LOG_INF("  *** TinyGS Web Login URL: %s", (char *)rx_payload);
                LOG_INF("  *** Open this URL to configure auto-tune and other settings");
            } else {
                LOG_INF("  → Unhandled command: %s", cmnd);
            }
        }

        if (pub->message.topic.qos == MQTT_QOS_1_AT_LEAST_ONCE) {
            struct mqtt_puback_param ack = { .message_id = pub->message_id };
            mqtt_publish_qos1_ack(client, &ack);
        }
        break;
    }

    case MQTT_EVT_SUBACK:
        LOG_INF("MQTT SUBACK id=%u result=%d",
                evt->param.suback.message_id, evt->result);
        break;

    default:
        LOG_DBG("MQTT event: %d (connected %us)",
                evt->type,
                (unsigned)(now - mqtt_connected_uptime_ms) / 1000);
        break;
    }
}

