Bwooce/tinygs_nRF52/src/main.cpp
static FATFS fat_fs;
static int boot_index_exists = 0;
static int boot_index_size = -1;
static struct fs_mount_t mp = {
    .type = FS_FATFS,
    .mnt_point = "/NAND:",
    .fs_data = &fat_fs,
};

static const char *html_content =
    "<!DOCTYPE html><html><head><title>TinyGS Configurator</title>"
    "<style>body{font-family:sans-serif;max-width:600px;margin:40px auto;padding:20px;background:#f4f4f9;}"
    ".card{background:white;padding:20px;border-radius:8px;box-shadow:0 2px 4px rgba(0,0,0,0.1);}"
    "input{width:100%;padding:8px;margin:8px 0;box-sizing:border-box;border:1px solid #ccc;border-radius:4px;}"
    ".row{display:flex;gap:8px;} .row input{flex:1;}"
    "button{background:#5a67d8;color:white;border:none;padding:10px 20px;border-radius:4px;cursor:pointer;width:100%;font-size:16px;}"
    "button:hover{background:#434190;}</style>"
    "</head><body>"
    "<div class='card'>"
    "<h1>TinyGS nRF52 Setup</h1>"
    "<p>Configure your Ground Station. Save config.json to this drive, then reboot.</p>"
    "<hr>"
    "<label>Station Name:</label><input type='text' id='station' placeholder='my_station_name'>"
    "<label>MQTT Username:</label><input type='text' id='user' placeholder='From TinyGS dashboard'>"
    "<label>MQTT Password:</label><input type='password' id='pass' placeholder='From TinyGS dashboard'>"
    "<br>"
    "<label>Station Location (required for satellite assignment):</label>"
    "<div class='row'>"
    "<input type='number' step='0.0001' id='lat' placeholder='Latitude (-33.8688)'>"
    "<input type='number' step='0.0001' id='lon' placeholder='Longitude (151.2093)'>"
    "<input type='number' step='1' id='alt' placeholder='Alt (m)'>"
    "</div>"
    "<br>"
    "<button onclick='saveConfig()'>Save config.json</button>"
    "<p style='font-size:0.8em;color:#666;'>Location must be set here &mdash; the TinyGS website cannot change it.</p>"
    "</div>"
    "<script>"
    "function saveConfig() {"
    "  const config = {"
    "    station: document.getElementById('station').value,"
    "    mqtt_user: document.getElementById('user').value,"
    "    mqtt_pass: document.getElementById('pass').value,"
    "    lat: parseFloat(document.getElementById('lat').value),"
    "    lon: parseFloat(document.getElementById('lon').value),"
    "    alt: parseFloat(document.getElementById('alt').value) || 0"
    "  };"
    "  const blob = new Blob([JSON.stringify(config, null, 2)], { type: 'application/json' });"
    "  const a = document.createElement('a');"
    "  a.href = URL.createObjectURL(blob);"
    "  a.download = 'config.json';"
    "  a.click();"
    "}"
    "</script>"
    "</body></html>";

static void setup_usb_storage(void)
{
    struct fs_file_t file;
    struct fs_dirent entry;

    LOG_INF("Mounting FATFS...");

    /* Check FAT boot sector signature BEFORE mounting. FatFs will crash
     * (HardFault) on corrupted FAT data because it follows garbage pointers.
     * Reading raw flash is safe — no FatFs code involved. If invalid,
     * format through the disk driver (which manages the write cache). */
    {
        const struct device *flash_dev = DEVICE_DT_GET(DT_CHOSEN(zephyr_flash_controller));
        uint8_t sig[2];
        flash_read(flash_dev, 0xE2000 + 510, sig, 2);
        if (sig[0] == 0xFF && sig[1] == 0xFF) {
            /* Erased flash — fs_mount with MOUNT_MKFS will auto-format */
            LOG_INF("FATFS: partition erased, will auto-format on mount");
        } else if (sig[0] != 0x55 || sig[1] != 0xAA) {
            /* Corrupted data — erase partition and reboot to avoid FatFs crash */
            LOG_WRN("FATFS: corrupt boot sector (0x%02X 0x%02X), erasing",
                    sig[0], sig[1]);
            flash_erase(flash_dev, 0xE2000, 0x6000);
            LOG_INF("Partition erased, rebooting...");
            k_msleep(100);
            sys_reboot(SYS_REBOOT_COLD);
        }
    }

    int res = fs_mount(&mp);
    LOG_INF("FATFS mount: %d", res);

    if (res == 0) {
        /* Check if index.html exists, write if not */
        int stat_ret = fs_stat("/NAND:/index.html", &entry);
        /* Store pre-write stat result for deferred logging */
        int pre_stat = stat_ret;
        int pre_size = (stat_ret == 0) ? (int)entry.size : -1;
        int open_ret = -999, write_ret = -999;

        if (stat_ret != 0) {
            fs_file_t_init(&file);
            open_ret = fs_open(&file, "/NAND:/index.html", FS_O_CREATE | FS_O_WRITE);
            if (open_ret == 0) {
                write_ret = (int)fs_write(&file, html_content, strlen(html_content));
                fs_sync(&file);
                fs_close(&file);
            }
        }

        /* Verify after write attempt */
        stat_ret = fs_stat("/NAND:/index.html", &entry);
        boot_index_exists = (stat_ret == 0);
        boot_index_size = boot_index_exists ? (int)entry.size : -1;

        /* Pack debug info into boot_index_size for deferred logging.
         * If file missing: encode pre_stat, open_ret, write_ret */
        LOG_ERR("FATFS: stat=%d open=%d write=%d verify=%d",
                pre_stat, open_ret, write_ret,
                boot_index_exists ? boot_index_size : -999);
        /* Read config.json if it exists — station location, name, etc.
         * This is the only time we can read FATFS (before USB MSC takes over). */
        {
            static char cfg_buf[512];
            struct fs_file_t cfg;
            fs_file_t_init(&cfg);
            if (fs_open(&cfg, "/NAND:/config.json", FS_O_READ) == 0) {
                ssize_t n = fs_read(&cfg, cfg_buf, sizeof(cfg_buf) - 1);
                fs_close(&cfg);
                if (n > 0) {
                    cfg_buf[n] = '\0';
                    LOG_INF("Loaded config.json (%d bytes)", (int)n);

                    /* Parse latitude */
                    const char *p = strstr(cfg_buf, "\"lat\":");
                    if (p) {
                        float lat = strtof(p + 6, NULL);
                        if (lat >= -90.0f && lat <= 90.0f) {
                            tinygs_station_lat = lat;
                        }
                    }
                    /* Parse longitude */
                    p = strstr(cfg_buf, "\"lon\":");
                    if (p) {
                        float lon = strtof(p + 6, NULL);
                        if (lon >= -180.0f && lon <= 180.0f) {
                            tinygs_station_lon = lon;
                        }
                    }
                    /* Parse altitude */
                    p = strstr(cfg_buf, "\"alt\":");
                    if (p) {
                        tinygs_station_alt = strtof(p + 6, NULL);
                    }

                    /* Parse station name */
                    p = strstr(cfg_buf, "\"station\":\"");
                    if (p) {
                        const char *end = strchr(p + 11, '"');
                        if (end && (end - p - 11) < (int)sizeof(cfg_station)) {
                            memcpy(cfg_station, p + 11, end - p - 11);
                            cfg_station[end - p - 11] = '\0';
                        }
                    }
                    /* Parse MQTT username */
                    p = strstr(cfg_buf, "\"mqtt_user\":\"");
                    if (p) {
                        const char *end = strchr(p + 13, '"');
                        if (end && (end - p - 13) < (int)sizeof(cfg_mqtt_user)) {
                            memcpy(cfg_mqtt_user, p + 13, end - p - 13);
                            cfg_mqtt_user[end - p - 13] = '\0';
                        }
                    }
                    /* Parse MQTT password */
                    p = strstr(cfg_buf, "\"mqtt_pass\":\"");
                    if (p) {
                        const char *end = strchr(p + 13, '"');
                        if (end && (end - p - 13) < (int)sizeof(cfg_mqtt_pass)) {
                            memcpy(cfg_mqtt_pass, p + 13, end - p - 13);
                            cfg_mqtt_pass[end - p - 13] = '\0';
                        }
                    }

                    LOG_INF("Config: station=%s user=%s lat=%.4f lon=%.4f alt=%.0f",
                            cfg_station, cfg_mqtt_user,
                            (double)tinygs_station_lat,
                            (double)tinygs_station_lon,
                            (double)tinygs_station_alt);
                }
            } else {
                LOG_INF("No config.json found — using defaults");
            }
        }

